<script>

import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue"

export default {
  data() {
    return {}
  },
  components: {Header, Footer}
}
</script>

<template>
  <div class="wrapper">
    <Header nav-class="black"></Header>
    <main>
      <div class="title">О нас</div>
      <div class="container">
        <h2>Наша миссия</h2>
        <p>Мы стремимся приносить радость и красоту в вашу жизнь с помощью изысканных цветочных композиций. Наша цель — превратить каждый заказ в уникальное произведение искусства, которое будет радовать вас и ваших близких.</p>
        <h2>Что нас отличает</h2>
        <ul>
          <li>Свежесть и качество: Мы работаем только с проверенными поставщиками и тщательно отбираем цветы для наших букетов. Гарантируем свежесть и долговечность каждого цветка.</li>
          <li>Индивидуальный подход: У нас вы найдете букеты на любой вкус и повод. Если вы не нашли идеальный букет, наши флористы с радостью создадут для вас уникальную композицию по индивидуальному заказу.</li>
          <li>Быстрая доставка: Мы понимаем, как важна своевременность доставки цветов. Поэтому предлагаем быструю и надежную доставку, чтобы ваш подарок прибыл вовремя и в идеальном состоянии.</li>
          <li>Экологичность: Мы заботимся о природе и используем только экологически чистые материалы для упаковки и оформления наших букетов.</li>

        </ul>
        <h2>Наша команда</h2>
        <p>Наши флористы — это настоящие художники, влюбленные в свое дело. Каждая композиция создается с вниманием к деталям и стремлением превзойти ожидания клиентов. Мы постоянно учимся и совершенствуемся, чтобы радовать вас новыми идеями и вдохновляющими решениями.</p>
        <h3>Если у вас есть вопросы или вы хотите сделать заказ, наша команда всегда готова помочь. Свяжитесь с нами по телефону, электронной почте или социальные сети — мы с радостью ответим на все ваши запросы.

          Спасибо, что выбираете Blossom Bliss. Пусть каждый ваш день будет наполнен красотой и гармонией!</h3>
      </div>

    </main>

  </div>
  <Footer></Footer>
</template>

<style scoped>
.title {
  font-size: 48px;
  font-family: Ubuntu;
  font-weight: 300;
  margin-bottom: 50px;
}
.container{
  p{
    font-size: 20px;
    margin-top: 10px;
  }
  ul{
    margin-top: 20px;
    margin-left: 25px;
  }
  li{
    margin-bottom: 20px;
    font-size: 20px;
  }
  h2{
    font-size: 32px;
    margin-top: 10px;
  }
  h3{
    margin-top: 25px;
  }
  .icon-container{
    display: flex;
    gap: 50px;
    margin-top: 20px;
    img{
      cursor: pointer;
      width: 50px;
      height: 50px;
    }
  }
}


</style>